{"pages":[{"title":"categories","text":"","link":"/categories/index.html"}],"posts":[{"title":"Epi 01 Categoricalism, Consequentialism, Utilitarianism","text":"Epi 01 aCategoricalism- locate morality in certain duties and acts regardless of cosequences - KantismConsequentialism - locate morality in the consequences of acts - Utilitarianism Epi 01 bDo we have a certain fundamental rights? Do fair procedure justify the any result? What is the moral work of consent? Utilitarian philosophers:John Stuart MillBentham #Note","link":"/2019/03/27/Epi 01/"},{"title":"Epi 02 Put a price tag on life","text":"Put a price tag on lifeBenthame Utilitarian Idea: Greatest Good for the greatest number Objections 1. Fail to respect indviduals / Minority right 2. Not possible to aggregate all value into numbers 1. Using a single number 2. If the preference has a worthier different Example: Cost-benefits analysis The cigarette The Ford Pinto the cost of life Measure the pleasureExample Torture to extract information for the collective good Translating value to number the value of entrance to women dormJohn Stuart Millhumanize the Utilitarian and accommodate the humanism concerns respond to the objections 1. Fail to respect indviduals / Minority right 3. Not possible to aggregate all value into numbers 1. Using a single number 2. If the preference has a worthier different #Note#","link":"/2019/03/27/Epi 02/"},{"title":"Epi 03 Free to choose & Libertarianism","text":"Free to chooseJohn Stuart MillRespect individual’s right =&gt;In the long run, the justice makes the society better off Justice is the chef part and binding part of society Objection to Mill: 1. Why is the justice the chef part? 2. If the Utilitarian analysis works out, is it the only reason that people respect the personal right, or it is some other reason that have to do with people’s intrinsic right?LibertarianismThe fundamental individuals right are the right to libertyWe are not the use to the society because we are separate individuals and we have fundamental right: to free to chooseWe belong to ourselvesThree things the modern state do in the Libertarianism is not right and just 1. Paternal Legislation 2. Moral Legislation 3. Redistribution of Income Who own usObjection to Libertarianism The poor need the money more The end don’t justify the act Need is one thing and deserve is another It’s not really a slavery to tax / Taxation by consent of the governed is not coercion Democracy except fundamental rights The successful one owns a debt to society No self-procession in a society The wealth based on luck Where is comes from the the moral force of the libertarian claim that we own our selves ?John Locke #Note","link":"/2019/03/27/Epi 03/"},{"title":"Epi 04 This land is my land & This land is my land","text":"This land is my landJohn LockeSome fundamental right can not be override by the government=&gt; Those fundamental right includes nature right including life, liberty, and property=&gt;Property right is a natural right because it comes before the government=&gt; owner of ourselves Natural rightState of nature = State of liberty where human beings are natural beings and free and equal before the government and law Law of nature give the constrain that we can’t give up or take away from someone else In the state of natureWhy can’t I give up the right of liberty: Freedom is not doing whatever we want::In one hand, the idea that natural rights are unalienable rights which makes something I own less fully mine::::On the other hand, for a right to be unalienable, makes it more deeply and profoundly mine.:: Property right in the state of natureMoralHow to define the legitimate government Consenting AdultsLocke’s legitimate government: Government based on consent and limitation Certain fundamental right constrain the government can do how there could be the right to property without consent before the government come to the scene? There is a way to create property not just in the things we hunt but in the land itself, provided there is enough and it’s good left for others Consentlegitimate government is government based on consent State of nature: the condition that we decide to leave Undertake an act of consent where one agree to give up the enforcement power and create government where there will be legislature to create law and where every one agrees to abide by whatever the majority decides =&gt; What can the majority decide? How much the majority have?How limited is the government created by consent?It is limited by the obligation on the part of majority to respect and to enforce the fundamental right of individuals. Property is natural but conventional It is natural in the sense that we have a fundamental and unalienable right that is respected by the government Its is conventional in the sense that it is a further question of what counts as the property and what counts as taking the property that is for the government to define, namely Collective consents ::Locke: the non-arbitrary rules and laws by the majority is not a violation of basic right.:: The only limitation of government is the arbitrary power of the government #Note","link":"/2019/03/27/Epi 04/"},{"title":"Epi 05 Hired Gun & Consent","text":"Hired GunTaxation with consentPrior act of consent to join the society and agree to be bound by the society - The government have the right to violate self-procession as fas as it is not arbitraryFor Sale: Motherhood#Note","link":"/2019/03/27/Epi 05/"},{"title":"Epi 06 Mind your Motive","text":"Mind your MotiveKantClaims: 1. We are all rational beings 2. We are being who are capable of reason 3. We are autonomous being 4. admitted the utilitarian When we seeks the pleasure, we aren’t acting freely but rather the slave of impulse and according to the natural necessities. 5. To act freely = to act autonomously = to act according to the laws I give myself To act freely is not to choose the best means to a given end but is to choose the end for its own sake ::We act as means to realization of ends::::We are instrument rather than authors of the purpose we pursue::::Insofar we act autonomously, we become as ends in ourselves.:: What makes an action morally worth has to do with the motive, with the quality of the will, with the intention of duty Only actions done for the sake of moral laws and for the sake of duty is moral worth. WhatThe reason that leads us to the moral law we give to ourselves is the kind of pure practical reason we all shared Moral PrincipleThree contrast Motive : duty vs inclination Determination : autonomous vs heteronomous Imperatives : hypothetical imperative and categorical imperative What is the categorical imperative ?What is the superme principle of morality ?What it commands of us ? The categorical imperative The formula of universal lawUniversalise the maxim which you are about to act The formula of humanity as End::Human beings are ends in itself not as use of any uses::When we deal with other people for the sake of advanced project as far as we treat them in the way that is consistent with their dignity #Note","link":"/2019/03/27/Epi 06/"},{"title":"Epi 07 A Deal is a Deal","text":"lessons in lyingHow is morality possibleHow is categorical imperative possible ::If the utilitarian is true, if I am the only subject of the deliverances of my sense, the pain, the pleasure, the pain and appetite, if that’s all there were to humanity, we wouldn’t be freedom because in that case every exercise of will would be conditioned by the desire for some objects:: How is categorical imperative possibleOnly because the idea of freedom makes myself as members of intelligible world. ::It is because of the two standpoints that the realm of freedom and the real of necessity, there is always potentially a gap between what we do and what we ought to do:: A lie and a misleading truthKant based morality not on consequenlist but on moral law A Deal is a DealJustice arise from social contract It is exceptional contract in the sense that it is not actual contract but rather the idea of reasons. John Rawls justice from the Hypothetical agreement Critics of utilitarian veil of igorance ::what is the moral force of this kind of hypothetical agreement ?:: Behind the veil of ignorance equal of knowledge in different parties equal of bargain power in different parties veil of ignorance create a equality by ruling out the difference of knowledge and power::What is the moral force of the actual contracts?:: 1. How do the actual contracts bind or obligate? Answer: 1. benefit-based =&gt; reciprocity Instruments of mutual benefits difference of knowledge in different parties 2. consent-based =&gt; autonomy difference of bargain power in different parties 2. How do they justify the terms they produce? 1. They don’t 2. Actual contracts are not self-suffiencit 3. Moral limited of actual contracts 1. Mutual agreements doesn’t means fairness 2. A contract is not sufficient or not even the necessity condition of there being a obligation David Hume #Note","link":"/2019/03/27/Epi 07/"},{"title":"Epi 09 Arguing affirmative action","text":"Arguing affirmative actionMoral desert and its relation to the distributive justice Corrective: Correcting for difference in backgroundCompensatory: for past wrongs - objection: is it fair to ask people today to sacrifice for something they are not implicatedDiversity: for educational experience / for society as a whole Is people ’s right being violated when being asked and used for affirmative questions and the social mission? She doesn’t have a right and doesn’t deserve to be admitted ::Whether the moral desert is the basis of distributive justice?:: What’s the purpose?RawlsEgalitarian : Distributive justice is not a matter of moral desertLibertarian: tying distributive justice to the moral desert somehow fail to respect people as free beings Aristole Justice is a matter of giving people what they deserve things and the persons to whom the things are assigned discrimnation in according with the difference of vitrue the best flute goes to the best player because that’s ::what flutes are for:: TelosThe end, the goal Aristole’s view: Natural world have a natural order and purposeIt wasn’t only the social practice but all of nature was understood in the meaningful order, inquired into the the telos of the nature ::The way to think about justice is to reason from the purpose::What’s the proper purpose of the end ? #Note","link":"/2019/03/27/Epi 09/"},{"title":"Epi 08 What is a fair start","text":"What is a fair startTwo Principle Equal basic liberties Freedom of speech, freedom of assembly and freedom of liberty Difference principle only those social and Economic inequality is only allowed that work to the benefit to the least well-off The distribution of income and wealth and opportunity should not based on morally arbitrary factors Meritocratic systemThe arbitrary distribution of income and wealth and opportunity should not influence the starting point John Rawls: the fairness system should go beyond the Meritocratic system ::Change the terms on which people are entitle the fruits of the exercise of those talents:: People may benefits their fortunes but only works to the benefit to the least well-off RawlsEven the efforts can be arbitrary based on the family circumstance from which we can claim no credits for What do we deserve Objections to Difference principle What about incentives? What about effort and moral desert? We can claim credit from family circumstances You don’t really believe in effort is the basis of moral desert but rather the contribution the basis of moral desert What about self-ownership? Moral desert and entitlements to legitimate expectation::Distributive justice is not a matter of Moral desert but rather Entitlements:: We are entitled to the benefits for the exercise of our talents, but it is mistake and conceit to suppose that we deserve in a society that values and prize the talents we happened to have Two morality at stake The problem about effort and moral desert? I live in a society that happens to prize my talent #Note","link":"/2019/03/27/Epi 08/"},{"title":"Epi 10 The Good Citizen","text":"The good citizenAristole: In reasoning about the justice and rights, we have unavoidable reasoning about the purpose or the end or telos of the social practice institution justice means gives equal things to equal person ::looking into the essential nature of the thing we are distributing.:: How should the political roles be assign?we should look into the end of politicsthe politics should be about realizing the good life Aristotle Therefore, those who contribute the most to the an association of shaping the good should have a greater share because they are in a position to contribute the most, to which the political community is essentially about Why is the policial life participation somehow connected to live a good lifeAristotle: - only, by living in a polis do we fully realize our nature. Human beings are by nature meant to live in a polis because it is only in polis are we allow to exercise the capacity of language, the deliberate about right or wrong. - happiness is a activity of soul in accordance with virtue - shaping the soul is the purpose of the objects of legislature - Virtue is only something we can acquire by exercising and by doing - The link between the distributive justice pricinple and the telos Freedom vs FitObjection to Aristotle If certain social roles are fitting to people, where does that leave people to choose for their roles Telogical social justice threaten the basic liberty rights hard to come to agreement whether the right is prior to the good what it means to be a free moral agentsFor slavery to be just Slavery is necessary for the community as whole to functionFor some citizens There are some people to be the slave is the just #Note","link":"/2019/03/27/Epi 10/"},{"title":"Epi 11 The Claims of Community","text":"The claims of community whether the right is prior to the good what it means to be a free moral agents Kant:Its one thing to support a framework of right within which people can pursue their life and it’s another thing to base law and principle of justice on any principle of good The constitution body should not shape any particular What it means to be a free person ? Aristotle: We are free insofar as we are allow to realize our full potentials Kant: Freedom is to act autonomy =&gt; as free person, we are not bound by any historical tradition, we are the only author of the obligation that constrains us =&gt; but It can’t account of certain moral ties that can’t trace to consent Kant’s self did not have account of obligation of membership or solidarity or loyalty Narrative aspect of moral reflection Maclntyre :::The self can’t be detached and should not be detached from its particular ties of membership of history story narrative:: communitarian criticize the Individualism where I m what I myself chose to be Communitarian account of selfMoral and political obligationOn the liberal conception Natural duty - universal (liberal) duty for respect persons voluntary obligation such as deal and contracts (liberal, Rawl) obligation of membership or solidarity or loyalty (communitarian) Example Your Aged Parents vs Other’s Aged Parents Where our loyalty lies*Objections 1. The conflict membership leads to conflict moral obligation 2. Moral obligation vs emotional sentiments 3. Patriotism understood as solidarity beyond consent #Note","link":"/2019/03/27/Epi 11/"},{"title":"Epi 12 The Good Life","text":"Debating same-sex marriage Two way of defining justice Justice relativist Justice is bound up with the good in a relativist ::Reasoning about the purpose and ends of the good is the necessary::::feature of arguing about the justice:: The Good LifeIs it necessary or unavoidable to take up the good life to think about the justice? Yes moral reasoningJohn Rawls: reflective equilibriumPluralist society If we are going to think of our disagreements about morality and religion has bound up with our disagreements about justice, how are we ever going to find a way to our society that accords respect to fellow citizens we disagree? It depends which conception of respect one accepts #Note","link":"/2019/03/27/Epi 12/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/09/01/hello-world/"}],"tags":[{"name":"philosophy","slug":"philosophy","link":"/tags/philosophy/"}],"categories":[{"name":"Notes","slug":"Notes","link":"/categories/Notes/"},{"name":"WebDev","slug":"WebDev","link":"/categories/WebDev/"}]}